uhnp/src/Catalogs/ПараметрыОбъектовУчетаМСФО/ПараметрыОбъектовУчетаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыОбъектовУчетаМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаУчета</name>
    <type>
      <types>CatalogRef.ВидыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДоходов</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасходов</name>
    <type>
      <types>CatalogRef.СчетаУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыАванса</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыНДС</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ПараметрыОбъектовУчетаМСФО/ПараметрыОбъектовУчетаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыОбъектовУчетаМСФО</name>
  <resources>
    <name>ПараметрыУчетаМСФО</name>
    <type>
      <types>CatalogRef.ПараметрыОбъектовУчетаМСФО</types>
    </type>
  </resources>
  <dimensions>
    <name>Актив</name>
    <type>
      <types>DefinedType.АктивМСФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПланСчетовМСФО</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ВидыОбъектовУчетаМСФО/ВидыОбъектовУчетаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОбъектовУчетаМСФО</name>
  <predefined>
    <items>
      <name>АвансВыданный</name>
      <description>Аванс выданный</description>
    </items>
    <items>
      <name>АвансПолученный</name>
      <description>Аванс полученный</description>
    </items>
    <items>
      <name>ДЗ</name>
      <description>Дебиторская задолженность</description>
    </items>
    <items>
      <name>ДС</name>
      <description>Денежные средства</description>
    </items>
    <items>
      <name>МПЗ</name>
      <description>Запас</description>
    </items>
    <items>
      <name>Инвестиция</name>
      <description>Инвестиция</description>
    </items>
    <items>
      <name>КЗ</name>
      <description>Кредиторская задолженность</description>
    </items>
    <items>
      <name>НДС</name>
      <description>НДС</description>
    </items>
    <items>
      <name>Услуга</name>
      <description>Услуга</description>
    </items>
  </predefined>
  <attributes>
    <name>РазделПланаСчетов</name>
    <type>
      <types>CatalogRef.РазделыПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСчетУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСчетДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокСчетРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетДоходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАвансов</name>
    <type>
      <types>CatalogRef.ВидыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНДС</name>
    <type>
      <types>CatalogRef.ВидыОбъектовУчетаМСФО</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/СчетаБД/СчетаБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетаБД</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.ПланыСчетовБД</owners>
  <attributes>
    <name>Забалансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакиУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетСсылка</name>
    <type>
      <types>ChartOfAccountsRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВключатьВОСВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРаздел</name>
    <type>
      <types>EnumRef.РазделПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>УДАЛИТЬ_АктивОбязательство</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКурсовыхРазниц</name>
    <type>
      <types>EnumRef.СпособыРасчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппирующийСчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтложенногоНалога</name>
    <type>
      <types>CatalogRef.ВидыВременныхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляИсключенийПриТрансляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатежныйИнструмент</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИспользоватьВидыДвижений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделПланаСчетов</name>
    <type>
      <types>CatalogRef.РазделыПланаСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетаУчетаКурсовыхРазниц</name>
    <type>
      <types>CatalogRef.СчетаУчетаКурсовыхРазниц</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетИсточник</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВФВ</name>
    <type>
      <types>EnumRef.ПересчетыВФВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчетВВО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияКорреспонденцииСчета</name>
    <type>
      <types>EnumRef.СпособыДетализацииКорреспонденцииСчета</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыСубконто</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоОбороты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоСальдо</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакиУчетаСубконто</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидСубконтоСсылка</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/СчетаУчетаМСФО/СчетаУчетаМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СчетаУчетаМСФО</name>
  <attributes>
    <name>ПланСчетовБД</name>
    <type>
      <types>CatalogRef.ПланыСчетовБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/Catalogs/ПараметрыОбъектовУчетаМСФО/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	Поля.Добавить("Ссылка");
	Поля.Добавить("Наименование");
	Поля.Добавить("ВидОбъектаУчета");
	Поля.Добавить("СчетУчета");
	Поля.Добавить("СчетДоходов");
	Поля.Добавить("СчетРасходов");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если Не Данные.Свойство("ВидОбъектаУчета") Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Данные.Наименование) Тогда
		Представление = Данные.Наименование;
		Возврат;
	КонецЕсли;
	
	МассивНаименование = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Данные.ВидОбъектаУчета);
	
	ДобавитьСчетаУчетаМСФО(МассивНаименование, Данные.СчетУчета);
	ДобавитьСчетаУчетаМСФО(МассивНаименование, Данные.СчетДоходов);
	ДобавитьСчетаУчетаМСФО(МассивНаименование, Данные.СчетРасходов);
	
	Представление = СтрСоединить(МассивНаименование, ", ");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииСобытий

Процедура ДобавитьСчетаУчетаМСФО(МассивНаименование, СчетаУчетаМСФО)
	
	СтрокаСчет = ?(ЗначениеЗаполнено(СчетаУчетаМСФО), Строка(СчетаУчетаМСФО), "");
	Если Не ЗначениеЗаполнено(СтрокаСчет) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНаименование.Добавить(СтрокаСчет);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ПланСчетовБД") Тогда
		Параметры.Отбор.Вставить("ПланСчетовБД", Параметры.ПланСчетовБД);
	КонецЕсли;
	
	Если Параметры.Свойство("РазделПланаСчетов") Тогда
		
		ЕстьАвансы = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры, "Авансы");
		ВидОбъектаУчета = ВидыОбъектовУчета(Параметры.РазделПланаСчетов, ЕстьАвансы);
		
		Параметры.Отбор.Вставить("ВидОбъектаУчета", ВидОбъектаУчета);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограмныйИнтерфейс

Функция ВидыОбъектовУчета(РазделПланаСчетов, ЕстьАвансы = Неопределено) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыОбъектовУчетаМСФО КАК т
	|ГДЕ
	|	т.РазделПланаСчетов В(&РазделПланаСчетов)");
	Запрос.УстановитьПараметр("РазделПланаСчетов", РазделПланаСчетов);
	
	Если ЕстьАвансы = Истина Тогда
		Запрос.Текст = Запрос.Текст + " И т.ИмяПредопределенныхДанных НЕ В (""ДЗ"", ""КЗ"")";
	ИначеЕсли ЕстьАвансы = Ложь Тогда
		Запрос.Текст = Запрос.Текст + " И т.ИмяПредопределенныхДанных НЕ В (""АвансВыданный"", ""АвансПолученный"")";
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецФункции

Функция ПолучитьПараметры(Объект, ПланСчетовМСФО) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.ПараметрыУчетаМСФО КАК ПараметрыУчетаМСФО
	|ИЗ
	|	РегистрСведений.ПараметрыОбъектовУчетаМСФО КАК т
	|ГДЕ
	|	т.ПланСчетовМСФО = &ПланСчетовМСФО
	|	И т.Актив В (&Актив, НЕОПРЕДЕЛЕНО)
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Актив = &Актив УБЫВ,
	|	т.Актив");
	
	Если ЗначениеЗаполнено(Объект) Тогда
		
		МД = Объект.Метаданные();
		Имя = МД.ПолноеИмя();
		
		Дополнения = Новый Массив;
		Дополнения.Добавить(СтрШаблон("ЗНАЧЕНИЕ(%1.ПустаяСсылка)", Имя));
			
		Если МД.Имя = "Номенклатура" Тогда
			Шаблон = "ВЫРАЗИТЬ(&Актив КАК %1).НоменклатурнаяГруппа";
			Если ИдентификацияПродуктаУХКлиентСервер.ЭтоЕХ() Тогда
				Шаблон = "ВЫРАЗИТЬ(&Актив КАК %1).ГруппаФинансовогоУчета";
			КонецЕсли;
			Дополнения.Добавить(СтрШаблон(Шаблон, Имя));
		ИначеЕсли МД.Иерархический Тогда
			Шаблон = "ВЫРАЗИТЬ(&Актив КАК %1).Родитель";
			Дополнения.Добавить(СтрШаблон(Шаблон, Имя));
		КонецЕсли;
		
		Запрос.Текст= СтрЗаменить(Запрос.Текст, "НЕОПРЕДЕЛЕНО", СтрСоединить(Дополнения, ","));
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Актив", 			Объект);
	Запрос.УстановитьПараметр("ПланСчетовМСФО", ПланСчетовМСФО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПустаяСсылка();	
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().Получить(0).Получить(0);
	
КонецФункции

Функция ПараметрыПоУмолчанию(ПланСчетовБД, ВидОбъектаУчета) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПараметрыОбъектовУчетаМСФО КАК т
	|ГДЕ
	|	т.ПланСчетовБД = &ПланСчетовБД
	|	И т.ВидОбъектаУчета = &ВидОбъектаУчета
	|	И НЕ т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Код УБЫВ");
	Запрос.УстановитьПараметр("ПланСчетовБД", ПланСчетовБД);
	Запрос.УстановитьПараметр("ВидОбъектаУчета", ВидОбъектаУчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить().Получить(0).Ссылка;
	
КонецФункции

Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетУчетаСубконто1");
	Субконто.Вставить(2, "СчетУчетаСубконто2");
	Субконто.Вставить(3, "СчетУчетаСубконто3");
	
	Результат.Вставить("СчетУчета", Субконто);
	
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетДоходовСубконто1");
	Субконто.Вставить(2, "СчетДоходовСубконто2");
	Субконто.Вставить(3, "СчетДоходовСубконто3");
	
	Результат.Вставить("СчетДоходов", Субконто);
		
	Субконто = Новый Соответствие;
	Субконто.Вставить(1, "СчетРасходовСубконто1");
	Субконто.Вставить(2, "СчетРасходовСубконто2");
	Субконто.Вставить(3, "СчетРасходовСубконто3");
	
	Результат.Вставить("СчетРасходов", Субконто);
		
	Возврат Результат;
	
КонецФункции

Функция ТекстЗапроса_втСчетаУчета(НомераТаблиц, ПоляАналитик, ПутиСубконто) Экспорт

	НомераТаблиц.Вставить("втСчетаУчета", НомераТаблиц.Количество());

	ТекстЗапроса = СтрЗаменить(ШаблонЗапроса_втСчетаУчета(), "&ПараметрыОбъектовУчета", ТекстЗапроса_ПолучениеСчетов(ПоляАналитик));
	
	ШаблонКогдаТогда = "КОГДА &.ТипДанных ПОДОБНО ""&&""+""%1""+""&&"" ТОГДА ""%1"" ";
	ШаблонРоль = СтрЗаменить(МСФОУХ.ВыборТипаСубконто(ШаблонКогдаТогда, ПутиСубконто), "&&", "%");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РольСубконто1", СтрЗаменить(ШаблонРоль, "&", "ВидСубконто1"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РольСубконто2", СтрЗаменить(ШаблонРоль, "&", "ВидСубконто2"));
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&РольСубконто3", СтрЗаменить(ШаблонРоль, "&", "ВидСубконто3"));
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапроса_ПолучениеСчетов(ПоляАналитикТекстом)
	
	ТекстЗапроса = Новый Массив;
	ШаблонЗапроса = 
	"
	|ВЫБРАТЬ
	|	т.%1
	|ИЗ
	|	%2 КАК т
	|ГДЕ 
	|	т.%1.Счет <> ЗНАЧЕНИЕ(Справочник.СчетаБД.ПустаяСсылка)
	|"; // @query-part
	
	ПоляАналитик = СтрРазделить(ПоляАналитикТекстом, Символы.ПС);
	
	Для каждого ПолеАналитики Из ПоляАналитик Цикл
		ЧастиА = СтрРазделить(СокрЛП(ПолеАналитики), ".");
		ТекстЗапроса.Добавить(СтрШаблон(ШаблонЗапроса, ЧастиА[1], ЧастиА[0]));
	КонецЦикла;
	
	Возврат СтрСоединить(ТекстЗапроса, " ОБЪЕДИНИТЬ ВСЕ ");

КонецФункции

Функция ШаблонЗапроса_втСчетаУчета()
	
	Возврат
	"ВЫБРАТЬ
	|	т.Ссылка КАК АналитикаУчета,
	|	т.Счет КАК СчетИБ,
	|	т.Счет.СчетСсылка КАК СчетСсылка,
	|	ВЫБОР
	|		КОГДА ИСТИНА
	|			ТОГДА т.Счет.СчетСсылка
	|		ИНАЧЕ т.Счет
	|	КОНЕЦ КАК Счет,
	|	т.Счет.СчетСсылка.УчетПоПодразделениям КАК УчетПоПодразделениям,
	|	т.Счет.СчетСсылка.УчетПоНаправлениямДеятельности КАК УчетПоНаправлениямДеятельности,
	|	т.Счет.СчетСсылка.Вид КАК Вид,
	|	т.Счет.СчетСсылка.Валютный КАК Валютный,
	|	т.Счет.СчетСсылка.Количественный КАК Количественный,
	|	ВЫБОР
	|		КОГДА т.Субконто1 = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		КОГДА 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Справочник.ИдентификаторыОбъектовМетаданных КАК мд
	|				ГДЕ
	|					мд.ЗначениеПустойСсылки = т.Субконто1)
	|			ТОГДА NULL
	|		ИНАЧЕ т.Субконто1
	|	КОНЕЦ КАК Субконто1,
	|	ВЫБОР
	|		КОГДА т.Субконто2 = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		КОГДА 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Справочник.ИдентификаторыОбъектовМетаданных КАК мд
	|				ГДЕ
	|					мд.ЗначениеПустойСсылки = т.Субконто2)
	|			ТОГДА NULL
	|		ИНАЧЕ т.Субконто2
	|	КОНЕЦ КАК Субконто2,
	|	ВЫБОР
	|		КОГДА т.Субконто3 = НЕОПРЕДЕЛЕНО
	|			ТОГДА NULL
	|		КОГДА 1 В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					1
	|				ИЗ
	|					Справочник.ИдентификаторыОбъектовМетаданных КАК мд
	|				ГДЕ
	|					мд.ЗначениеПустойСсылки = т.Субконто3)
	|			ТОГДА NULL
	|		ИНАЧЕ т.Субконто3
	|	КОНЕЦ КАК Субконто3,
	|	ЕСТЬNULL(ВидСубконто1.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто1,
	|	ЕСТЬNULL(ВидСубконто2.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто2,
	|	ЕСТЬNULL(ВидСубконто3.ВидСубконтоСсылка, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоКорпоративные.ПустаяСсылка)) КАК ВидСубконто3,
	|	&РольСубконто1 КАК РольСубконто1,
	|	&РольСубконто2 КАК РольСубконто2,
	|	&РольСубконто3 КАК РольСубконто3
	|ПОМЕСТИТЬ втСчетаУчета
	|ИЗ
	|	Справочник.СчетаУчетаМСФО КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто1
	|		ПО т.Счет = ВидСубконто1.Ссылка
	|			И (ВидСубконто1.НомерСтроки = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто2
	|		ПО т.Счет = ВидСубконто2.Ссылка
	|			И (ВидСубконто2.НомерСтроки = 2)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаБД.ВидыСубконто КАК ВидСубконто3
	|		ПО т.Счет = ВидСубконто3.Ссылка
	|			И (ВидСубконто3.НомерСтроки = 3)
	|ГДЕ
	|	т.Ссылка В(&ПараметрыОбъектовУчета)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчета";

КонецФункции

#КонецОбласти

#КонецЕсли
